package za.co.wethinkcode.Client;
import java.util.stream.Stream;

public class asciiArt{
    //requires java 15 and above!

    public static final String rw = """
                             /$$$$$$$            /$$                   /$$           /$$      /$$                     /$$       /$$
                            | $$__  $$          | $$                  | $$          | $$  /$ | $$                    | $$      | $$
                            | $$  \\ $$  /$$$$$$ | $$$$$$$   /$$$$$$  /$$$$$$        | $$ /$$$| $$  /$$$$$$   /$$$$$$ | $$  /$$$$$$$
                            | $$$$$$$/ /$$__  $$| $$__  $$ /$$__  $$|_  $$_/        | $$/$$ $$ $$ /$$__  $$ /$$__  $$| $$ /$$__  $$
                            | $$__  $$| $$  \\ $$| $$  \\ $$| $$  \\ $$  | $$          | $$$$_  $$$$| $$  \\ $$| $$  \\__/| $$| $$  | $$
                            | $$  \\ $$| $$  | $$| $$  | $$| $$  | $$  | $$ /$$      | $$$/ \\  $$$| $$  | $$| $$      | $$| $$  | $$
                            | $$  | $$|  $$$$$$/| $$$$$$$/|  $$$$$$/  |  $$$$/      | $$/   \\  $$|  $$$$$$/| $$      | $$|  $$$$$$$
                            |__/  |__/ \\______/ |_______/  \\______/    \\___/        |__/     \\__/ \\______/ |__/      |__/ \\_______/
                                                                                                                                  \s
                            BY DBN-11™
                    """;

    public static final String rw2 = """
                     ____   ___   ____    ___   ______      __    __   ___   ____   _      ___   _____
                    |    \\ /   \\ |    \\  /   \\ |      |    |  |__|  | /   \\ |    \\ | |    |   \\ / ___/
                    |  D  )     ||  o  )|     ||      |    |  |  |  ||     ||  D  )| |    |    (   \\_\s
                    |    /|  O  ||     ||  O  ||_|  |_|    |  |  |  ||  O  ||    / | |___ |  D  \\__  |
                    |    \\|     ||  O  ||     |  |  |      |  `  '  ||     ||    \\ |     ||     /  \\ |
                    |  .  \\     ||     ||     |  |  |       \\      / |     ||  .  \\|     ||     \\    |
                    |__|\\_|\\___/ |_____| \\___/   |__|        \\_/\\_/   \\___/ |__|\\_||_____||_____|\\___|
                                                                                                     \s
                    BY DBN-11™                                                                                 
                    """;


    public static final String rw3 = """
                    ██████   ██████  ██████   ██████  ████████     ██     ██  ██████  ██████  ██      ██████  ███████\s
                    ██   ██ ██    ██ ██   ██ ██    ██    ██        ██     ██ ██    ██ ██   ██ ██      ██   ██ ██     \s
                    ██████  ██    ██ ██████  ██    ██    ██        ██  █  ██ ██    ██ ██████  ██      ██   ██ ███████\s
                    ██   ██ ██    ██ ██   ██ ██    ██    ██        ██ ███ ██ ██    ██ ██   ██ ██      ██   ██      ██\s
                    ██   ██  ██████  ██████   ██████     ██         ███ ███   ██████  ██   ██ ███████ ██████  ███████\s
                                                                                                                     \s
                                                                                                                     \s
                    BY DBN-11™                                                                                                 
                    """;

    //            System.out.println(rw3);
    public static final String rw4 = """
                       ___       __        __    _      __         __   __ \s
                      / _ \\___  / /  ___  / /_  | | /| / /__  ____/ /__/ /__
                     / , _/ _ \\/ _ \\/ _ \\/ __/  | |/ |/ / _ \\/ __/ / _  (_-<
                    /_/|_|\\___/_.__/\\___/\\__/   |__/|__/\\___/_/ /_/\\_,_/___/
                                                                           \s
                    BY DBN-11™
                    """;

    public static final String rw5 = """
            8888888b.           888               888          888       888                  888      888         \s
            888   Y88b          888               888          888   o   888                  888      888         \s
            888    888          888               888          888  d8b  888                  888      888         \s
            888   d88P  .d88b.  88888b.   .d88b.  888888       888 d888b 888  .d88b.  888d888 888  .d88888 .d8888b \s
            8888888P"  d88""88b 888 "88b d88""88b 888          888d88888b888 d88""88b 888P"   888 d88" 888 88K     \s
            888 T88b   888  888 888  888 888  888 888          88888P Y88888 888  888 888     888 888  888 "Y8888b.\s
            888  T88b  Y88..88P 888 d88P Y88..88P Y88b.        8888P   Y8888 Y88..88P 888     888 Y88b 888      X88\s
            888   T88b  "Y88P"  88888P"   "Y88P"   "Y888       888P     Y888  "Y88P"  888     888  "Y88888  88888P'\s
                                                                                                                   \s
            BY DBN-11™
            """;

    public static final String rw6 = """
            888 88e            888                  d8     Y8b Y8b Y888P                  888      888      \s
            888 888D  e88 88e  888 88e   e88 88e   d88      Y8b Y8b Y8P   e88 88e  888,8, 888  e88 888  dP"Y\s
            888 88"  d888 888b 888 888b d888 888b d88888     Y8b Y8b Y   d888 888b 888 "  888 d888 888 C88b \s
            888 b,   Y888 888P 888 888P Y888 888P  888        Y8b Y8b    Y888 888P 888    888 Y888 888  Y88D\s
            888 88b,  "88 88"  888 88"   "88 88"   888         Y8P Y      "88 88"  888    888  "88 888 d,dP \s
                                                                                                            \s
            BY DBN-11™  
                    """;

    public static final String rw7 = """
                            _,.---._                 _,.---._    ,--.--------.                 ,-.-.    _,.---._                                        ,-,--. \s
              .-.,.---.   ,-.' , -  `.    _..---.  ,-.' , -  `. /==/,  -   , -\\       ,-..-.-./  \\==\\ ,-.' , -  `.   .-.,.---.    _.-.     _,..---._  ,-.'-  _\\\s
             /==/  `   \\ /==/_,  ,  - \\ .' .'.-. \\/==/_,  ,  - \\\\==\\.-.  - ,-./       |, \\=/\\=|- |==|/==/_,  ,  - \\ /==/  `   \\ .-,.'|   /==/,   -  \\/==/_ ,_.'\s
            |==|-, .=., |==|   .=.     /==/- '=' /==|   .=.     |`--`\\==\\- \\          |- |/ |/ , /==/==|   .=.     |==|-, .=., |==|, |   |==|   _   _\\==\\  \\   \s
            |==|   '='  /==|_ : ;=:  - |==|-,   '|==|_ : ;=:  - |     \\==\\_ \\          \\, ,     _|==|==|_ : ;=:  - |==|   '='  /==|- |   |==|  .=.   |\\==\\ -\\  \s
            |==|- ,   .'|==| , '='     |==|  .=. \\==| , '='     |     |==|- |          | -  -  , |==|==| , '='     |==|- ,   .'|==|, |   |==|,|   | -|_\\==\\ ,\\ \s
            |==|_  . ,'. \\==\\ -    ,_ //==/- '=' ,\\==\\ -    ,_ /      |==|, |           \\  ,  - /==/ \\==\\ -    ,_ /|==|_  . ,'.|==|- `-._|==|  '='   /==/\\/ _ |\s
            /==/  /\\ ,  ) '.='. -   .'|==|   -   / '.='. -   .'       /==/ -/           |-  /\\ /==/   '.='. -   .' /==/  /\\ ,  )==/ - , ,/==|-,   _`/\\==\\ - , /\s
            `--`-`--`--'    `--`--''  `-._`.___,'    `--`--''         `--`--`           `--`  `--`      `--`--''   `--`-`--`--'`--`-----'`-.`.____.'  `--`---' \s
            BY DBN-11™                                                                                 
            """;



    public static  final String rw9 = """
                                                                                                                                  \s
                                                                                                                                  \s
            ,-.----.                                 ___                       .---.                  ,--,                        \s
            \\    /  \\            ,---,             ,--.'|_                    /. ./|                ,--.'|        ,---,           \s
            ;   :    \\   ,---. ,---.'|     ,---.   |  | :,'               .--'.  ' ;  ,---.   __  ,-|  | :      ,---.'|           \s
            |   | .\\ :  '   ,'\\|   | :    '   ,'\\  :  : ' :              /__./ \\ : | '   ,'\\,' ,'/ /:  : '      |   | : .--.--.   \s
            .   : |: | /   /   :   : :   /   /   .;__,'  /           .--'.  '   \\' ./   /   '  | |' |  ' |      |   | |/  /    '  \s
            |   |  \\ :.   ; ,. :     |,-.   ; ,. |  |   |           /___/ \\ |    ' .   ; ,. |  |   ,'  | |    ,--.__| |  :  /`./  \s
            |   : .  /'   | |: |   : '  '   | |: :__,'| :           ;   \\  \\;      '   | |: '  :  / |  | :   /   ,'   |  :  ;_    \s
            ;   | |  \\'   | .; |   |  / '   | .; : '  : |__          \\   ;  `      '   | .; |  | '  '  : |__.   '  /  |\\  \\    `. \s
            |   | ;\\  |   :    '   : |: |   :    | |  | '.'|          .   \\    .\\  |   :    ;  : |  |  | '.''   ; |:  | `----.   \\\s
            :   ' | \\.'\\   \\  /|   | '/ :\\   \\  /  ;  :    ;           \\   \\   ' \\ |\\   \\  /|  , ;  ;  :    |   | '/  '/  /`--'  /\s
            :   : :-'   `----' |   :    | `----'   |  ,   /             :   '  |--"  `----'  ---'   |  ,   /|   :    :'--'.     / \s
            |   |.'            /    \\  /            ---`-'               \\   \\ ;                     ---`-'  \\   \\  /   `--'---'  \s
            `---'              `-'----'                                   '---"                               `----'              \s
            BY DBN-11™                                                                                 
            """;



    public static final String rw11 = """
             ▄▄▄▄▄▄▄▄▄▄▄ ▄▄▄▄▄▄▄▄▄▄▄ ▄▄▄▄▄▄▄▄▄▄  ▄▄▄▄▄▄▄▄▄▄▄ ▄▄▄▄▄▄▄▄▄▄▄       ▄         ▄ ▄▄▄▄▄▄▄▄▄▄▄ ▄▄▄▄▄▄▄▄▄▄▄ ▄           ▄▄▄▄▄▄▄▄▄▄  ▄▄▄▄▄▄▄▄▄▄▄\s
            ▐░░░░░░░░░░░▐░░░░░░░░░░░▐░░░░░░░░░░▌▐░░░░░░░░░░░▐░░░░░░░░░░░▌     ▐░▌       ▐░▐░░░░░░░░░░░▐░░░░░░░░░░░▐░▌         ▐░░░░░░░░░░▌▐░░░░░░░░░░░▌
            ▐░█▀▀▀▀▀▀▀█░▐░█▀▀▀▀▀▀▀█░▐░█▀▀▀▀▀▀▀█░▐░█▀▀▀▀▀▀▀█░▌▀▀▀▀█░█▀▀▀▀      ▐░▌       ▐░▐░█▀▀▀▀▀▀▀█░▐░█▀▀▀▀▀▀▀█░▐░▌         ▐░█▀▀▀▀▀▀▀█░▐░█▀▀▀▀▀▀▀▀▀\s
            ▐░▌       ▐░▐░▌       ▐░▐░▌       ▐░▐░▌       ▐░▌    ▐░▌          ▐░▌       ▐░▐░▌       ▐░▐░▌       ▐░▐░▌         ▐░▌       ▐░▐░▌         \s
            ▐░█▄▄▄▄▄▄▄█░▐░▌       ▐░▐░█▄▄▄▄▄▄▄█░▐░▌       ▐░▌    ▐░▌          ▐░▌   ▄   ▐░▐░▌       ▐░▐░█▄▄▄▄▄▄▄█░▐░▌         ▐░▌       ▐░▐░█▄▄▄▄▄▄▄▄▄\s
            ▐░░░░░░░░░░░▐░▌       ▐░▐░░░░░░░░░░▌▐░▌       ▐░▌    ▐░▌          ▐░▌  ▐░▌  ▐░▐░▌       ▐░▐░░░░░░░░░░░▐░▌         ▐░▌       ▐░▐░░░░░░░░░░░▌
            ▐░█▀▀▀▀█░█▀▀▐░▌       ▐░▐░█▀▀▀▀▀▀▀█░▐░▌       ▐░▌    ▐░▌          ▐░▌ ▐░▌░▌ ▐░▐░▌       ▐░▐░█▀▀▀▀█░█▀▀▐░▌         ▐░▌       ▐░▌▀▀▀▀▀▀▀▀▀█░▌
            ▐░▌     ▐░▌ ▐░▌       ▐░▐░▌       ▐░▐░▌       ▐░▌    ▐░▌          ▐░▌▐░▌ ▐░▌▐░▐░▌       ▐░▐░▌     ▐░▌ ▐░▌         ▐░▌       ▐░▌         ▐░▌
            ▐░▌      ▐░▌▐░█▄▄▄▄▄▄▄█░▐░█▄▄▄▄▄▄▄█░▐░█▄▄▄▄▄▄▄█░▌    ▐░▌          ▐░▌░▌   ▐░▐░▐░█▄▄▄▄▄▄▄█░▐░▌      ▐░▌▐░█▄▄▄▄▄▄▄▄▄▐░█▄▄▄▄▄▄▄█░▌▄▄▄▄▄▄▄▄▄█░▌
            ▐░▌       ▐░▐░░░░░░░░░░░▐░░░░░░░░░░▌▐░░░░░░░░░░░▌    ▐░▌          ▐░░▌     ▐░░▐░░░░░░░░░░░▐░▌       ▐░▐░░░░░░░░░░░▐░░░░░░░░░░▌▐░░░░░░░░░░░▌
             ▀         ▀ ▀▀▀▀▀▀▀▀▀▀▀ ▀▀▀▀▀▀▀▀▀▀  ▀▀▀▀▀▀▀▀▀▀▀      ▀            ▀▀       ▀▀ ▀▀▀▀▀▀▀▀▀▀▀ ▀         ▀ ▀▀▀▀▀▀▀▀▀▀▀ ▀▀▀▀▀▀▀▀▀▀  ▀▀▀▀▀▀▀▀▀▀▀\s
                                                                                                                                                      \s
            BY DBN-11™                                                                                 

            """;

    public static final String rw12 = """
                                                                                                                     \s
                                ,,                                                               ,,        ,,        \s
            `7MM""\"Mq.         *MM                  mm       `7MMF'     A     `7MF'            `7MM      `7MM        \s
              MM   `MM.         MM                  MM         `MA     ,MA     ,V                MM        MM        \s
              MM   ,M9 ,pW"Wq.  MM,dMMb.   ,pW"Wq.mmMMmm        VM:   ,VVM:   ,V ,pW"Wq.`7Mb,od8 MM   ,M""bMM ,pP"Ybd\s
              MMmmdM9 6W'   `Wb MM    `Mb 6W'   `Wb MM           MM.  M' MM.  M'6W'   `Wb MM' "' MM ,AP    MM 8I   `"\s
              MM  YM. 8M     M8 MM     M8 8M     M8 MM           `MM A'  `MM A' 8M     M8 MM     MM 8MI    MM `YMMMa.\s
              MM   `MbYA.   ,A9 MM.   ,M9 YA.   ,A9 MM            :MM;    :MM;  YA.   ,A9 MM     MM `Mb    MM L.   I8\s
            .JMML. .JMM`Ybmd9'  P^YbmdP'   `Ybmd9'  `Mbmo          VF      VF    `Ybmd9'.JMML. .JMML.`Wbmd"MMLM9mmmP'\s
                                                                                                                     \s
             BY DBN-11™                                                                                 

            """;


    public static final String rwBazooka = """
            {>==╦╦=ʖ><O>
            """;
    public static final String rwSniper = """
            (҂‾ ▵‾)︻デ═一
            """;

    public static final String rwShotgun = """
            ︻┻┳══━一
            """;

    public static final String rwMiss = """
            ¯\\_(ツ)_/¯
            """;

//     public static final String rwDead = """
//             (×_×) //animate
//             """;

    public void rwLook () throws InterruptedException {
        long start_time = System.currentTimeMillis();
        long wait_time = 2000;
        long end_time = start_time + wait_time;
        while (System.currentTimeMillis() < end_time) {
            System.out.print("\r" + "(o_o )");
            Thread.sleep(300);
            System.out.print("\r" + "( o_o)");
            Thread.sleep(300);
            System.out.print("\r" + "( o_o )");
            Thread.sleep(300);
            System.out.print("\r" + "( -_- )");
            Thread.sleep(200);
            System.out.print("\r" + "( o_o )");
            Thread.sleep(200);
            System.out.print("\r" + "( -_- )");
            Thread.sleep(200);
            System.out.print("\r" + "(-_- )");
            Thread.sleep(200);
            System.out.print("\r" + "(o_o )");
            Thread.sleep(300);
            System.out.println("");
        }
    }

    public void rwLoadBar(String message, int length, long timeInterval){
        char incomplete = '░';
        char complete = '█';
        StringBuilder builder = new StringBuilder();
        Stream.generate(() -> incomplete).limit(length).forEach(builder::append);
        System.out.println(message);
        for (int i = 0; i< length;i++){
            builder.replace(i,i+1,String.valueOf(complete));
            String progressBar = "\r" + builder;
            System.out.print(progressBar);
            try{
                Thread.sleep(timeInterval);
            }
            catch (InterruptedException ignored){

            }
        }

    }

    public void rwDead() throws InterruptedException{
        long start_time = System.currentTimeMillis();
        long wait_time = 2000;
        long end_time = start_time + wait_time;

        while (System.currentTimeMillis() < end_time){
                System.out.print("\r" + "(×_×)");
                Thread.sleep(300);
                System.out.print("\r" + "(-_-)");
                Thread.sleep(300);
                System.out.print("\r" + "(×_×)");
                Thread.sleep(300);
                System.out.print("\r" + "(-_-)");
                Thread.sleep(300);
                System.out.println(" ");
        }
        
    }

    public void rwGameOver() throws InterruptedException{
        long start_time = System.currentTimeMillis();
        long wait_time = 2000;
        long end_time = start_time + wait_time;
        
        while (System.currentTimeMillis() < end_time){
                System.out.print("\r" + "𝔾𝕒𝕞𝕖 𝕆𝕧𝕖𝕣");
                Thread.sleep(300);
                System.out.print("\r" + " ");
                Thread.sleep(300);
                System.out.print("\r" + "𝔾𝕒𝕞𝕖 𝕆𝕧𝕖𝕣");
                Thread.sleep(300);
                System.out.print("\r" + " ");
                Thread.sleep(300);
                System.out.println(" ");

        }
    }


    public void rwShotgun() throws InterruptedException{
        long start_time = System.currentTimeMillis();
        long wait_time = 2000;
        long end_time = start_time + wait_time;

        while (System.currentTimeMillis() < end_time){
                System.out.print("\r" + "︻┻┳══━一");
                Thread.sleep(100);
                System.out.print("\r" + "︻┻┳══━一 -");
                Thread.sleep(100);
                System.out.print("\r" + "︻┻┳══━一  -");
                Thread.sleep(100);
                System.out.print("\r" + "︻┻┳══━一   -");
                Thread.sleep(100);
                System.out.print("\r" + "︻┻┳══━一    -");
                Thread.sleep(100);
                System.out.print("\r" + "︻┻┳══━一     -");
                Thread.sleep(100);
                System.out.print("\r" + "︻┻┳══━一      -");
                Thread.sleep(100);
                System.out.println(" ");
        }

    }


    public void rwBazooka() throws InterruptedException{
        long start_time = System.currentTimeMillis();
        long wait_time = 2000;
        long end_time = start_time + wait_time;

        while (System.currentTimeMillis() < end_time){
                System.out.print("\r" + "{>==╦╦=ʖ><O>");
                Thread.sleep(100);
                System.out.print("\r" + "{>==╦╦=ʖ>  <O>");
                Thread.sleep(100);
                System.out.print("\r" + "{>==╦╦=ʖ>   <O>");
                Thread.sleep(100);
                System.out.print("\r" + "{>==╦╦=ʖ>    <O>");
                Thread.sleep(100);
                System.out.print("\r" + "{>==╦╦=ʖ>     <O>");
                Thread.sleep(100);
                System.out.print("\r" + "{>==╦╦=ʖ>      <O>");
                Thread.sleep(100);
                System.out.print("\r" + "{>==╦╦=ʖ>        <O>");
                Thread.sleep(100);
                System.out.println(" ");
        }


    }


    public void rwSniper() throws InterruptedException{

        long start_time = System.currentTimeMillis();
        long wait_time = 2000;
        long end_time = start_time + wait_time;

        while (System.currentTimeMillis() < end_time){
                System.out.print("\r" + "(҂‾ ▵‾)︻デ═一");
                Thread.sleep(100);
                System.out.print("\r" + "(҂‾ ▵‾)︻デ═一 -");
                Thread.sleep(100);
                System.out.print("\r" + "(҂‾ ▵‾)︻デ═一  -");
                Thread.sleep(100);
                System.out.print("\r" + "(҂‾ ▵‾)︻デ═一   -");
                Thread.sleep(100);
                System.out.print("\r" + "(҂‾ ▵‾)︻デ═一    -");
                Thread.sleep(100);
                System.out.print("\r" + "(҂‾ ▵‾)︻デ═一     -");
                Thread.sleep(100);
                System.out.print("\r" + "(҂‾ ▵‾)︻デ═一      -");
                Thread.sleep(100);
        }
    }


}
